In [1]:
import pandas as pd
df = pd.read_csv('dummy_demo.csv')
df.head()

   Unnamed: 0 age  potato_score      name
0           0  51      0.274015     Nixie
1           1  18           NaN  Jocelyne
2           2  70      0.561623  Virginia
3           3  69      0.397647    Lesley
4           4  75      0.322063   Juliana

In [2]:
df.describe() #describes only numerical data

        Unnamed: 0  potato_score
count  10000.00000   9022.000000
mean    4999.50000           inf
std     2886.89568           NaN
min        0.00000      0.000088
25%     2499.75000      0.251260
50%     4999.50000      0.501230
75%     7499.25000      0.746332
max     9999.00000           inf

In [3]:
df.info() #describes all data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    10000 non-null  int64
 1   age           10000 non-null  object
 2   potato_score  9022 non-null   float64
 3   name          10000 non-null  object
dtypes: float64(1), int64(1), object(2)
memory usage: 312.6+ KB

In [6]:
df['age'].unique()
df['age'] = pd.to_numeric(df['age'], errors = 'coerce') #this is a good choice if you have just a few nonnumeric values in a numeric column

In [7]:
df['age'].unique() #we need to probably do this a different way

array([51., 18., 70., 69., 75., nan, 50., 41., 58., 33., 43., 30., 44.,
       46., 66., 20., 56., 25., 47., 64., 65., 37., 80., 72., 59., 79.,
       62., 29., 73., 21., 36., 40., 26., 39., 24., 68., 32., 48., 28.,
       35., 63., 38., 19., 60., 57., 55., 42., 61., 49., 54., 45., 34.,
       78., 74., 31., 23., 27., 53., 52., 22., 71., 77., 76., 67.])

In [8]:
df['potato_score'].describe()

count    9022.000000
mean             inf
std              NaN
min         0.000088
25%         0.251260
50%         0.501230
75%         0.746332
max              inf
Name: potato_score, dtype: float64

In [10]:
import numpy as np
df['potato_score'].replace([np.inf, -np.inf], np.nan, inplace = True) #replace infinite values
df.describe()

        Unnamed: 0          age  potato_score
count  10000.00000  9053.000000   9015.000000
mean    4999.50000    49.015685      0.499884
std     2886.89568    18.213019      0.286943
min        0.00000    18.000000      0.000088
25%     2499.75000    33.000000      0.251037
50%     4999.50000    49.000000      0.501034
75%     7499.25000    65.000000      0.745697
max     9999.00000    80.000000      0.999822

In [11]:
df['name'].unique()

array(['Nixie', 'Jocelyne', 'Virginia', 'Lesley', 'Juliana', 'Valaree',
       'Maybelle', 'Corabella', 'Roch', 'Isidora', 'Magdalen',
       'Georgiana', 'Jeanelle', 'Anetta', 'Phillis', 'Lotty', 'Batsheva',
       'Terra', 'Vicki', 'Cris', 'Kelila', 'Kelci', 'Marylin', 'Sibby',
       'Goldie', 'Kit', 'Neille', 'Gaylene', 'Shaylah', 'Bryna',
       'Cecelia', 'Cosetta', 'Thia', 'Glenn', 'Holli', 'Karrah', 'Josey',
       'Konstanze', 'Augustine', 'Dodi', 'Shaylyn', 'Tally', 'Lena',
       'Alaine', 'Erda', 'Carilyn', 'Jilli', 'Alyssa', 'Eartha', 'Bryana',
       'Mellisent', 'Karrie', 'Amandie', 'Prudence', 'Devondra', 'Madge',
       'Tova', 'Lenora', 'Zia', 'Lynde', 'Fayre', 'Joceline', 'Sharyl',
       'Bobbe', 'Editha', 'Eloisa', 'Kristen', 'Teddi', 'Dulsea',
       'Mareah', 'Aidan', 'Emlynne', 'Julie', 'Maighdiln', 'Marion',
       'Megan', 'Lind', 'Ashely', 'Alyss', 'Andrei', 'Monica', 'Teddy',
       'Karyl', 'Rosalynd', 'Zorah', 'Jillene', 'Jenny', 'Norah',
       'Cacilia', 'Nettie', 'Aubree', 'Dominga', 'Merci', 'Juliet',
       'Bibbie', 'Margaret', 'Glynis', '99999', 'Candi', 'Dahlia',
       'Minny'], dtype=object)

In [20]:
df['name'].replace('99999', np.nan, inplace = True)
df['name'].unique()

array(['Nixie', 'Jocelyne', 'Virginia', 'Lesley', 'Juliana', 'Valaree',
       'Maybelle', 'Corabella', 'Roch', 'Isidora', 'Magdalen',
       'Georgiana', 'Jeanelle', 'Anetta', 'Phillis', 'Lotty', 'Batsheva',
       'Terra', 'Vicki', 'Cris', 'Kelila', 'Kelci', 'Marylin', 'Sibby',
       'Goldie', 'Kit', 'Neille', 'Gaylene', 'Shaylah', 'Bryna',
       'Cecelia', 'Cosetta', 'Thia', 'Glenn', 'Holli', 'Karrah', 'Josey',
       'Konstanze', 'Augustine', 'Dodi', 'Shaylyn', 'Tally', 'Lena',
       'Alaine', 'Erda', 'Carilyn', 'Jilli', 'Alyssa', 'Eartha', 'Bryana',
       'Mellisent', 'Karrie', 'Amandie', 'Prudence', 'Devondra', 'Madge',
       'Tova', 'Lenora', 'Zia', 'Lynde', 'Fayre', 'Joceline', 'Sharyl',
       'Bobbe', 'Editha', 'Eloisa', 'Kristen', 'Teddi', 'Dulsea',
       'Mareah', 'Aidan', 'Emlynne', 'Julie', 'Maighdiln', 'Marion',
       'Megan', 'Lind', 'Ashely', 'Alyss', 'Andrei', 'Monica', 'Teddy',
       'Karyl', 'Rosalynd', 'Zorah', 'Jillene', 'Jenny', 'Norah',
       'Cacilia', 'Nettie', 'Aubree', 'Dominga', 'Merci', 'Juliet',
       'Bibbie', 'Margaret', 'Glynis', nan, 'Candi', 'Dahlia', 'Minny'],
      dtype=object)

In [22]:
merger_df = pd.read_csv('merge_file.csv')
#print(merger_df.shape)
new_df = df.merge(merger_df, on = 'name') #on value is column that you merge on
new_df.head()

   Unnamed: 0_x   age  potato_score   name  Unnamed: 0_y  num_potatoes
0             0  51.0      0.274015  Nixie            50           621
1            29  37.0      0.876595  Nixie            50           621
2           113  72.0      0.009704  Nixie            50           621
3           130  54.0      0.718746  Nixie            50           621
4           167  78.0      0.230763  Nixie            50           621